/************************************************************************
*   文件名：ex27.cpp
*   文件描述：
    统计工龄 桶排序
*   创建人： Sakura, 2020-05-01  11:42
*   版本号：1.0
*   修改记录：
************************************************************************/
#include <iostream>
using namespace std;

int b[51];

int main()
{
    int n, m;
    cin >> n;
    for (int i = 0; i < n; i++)
    {
        cin >> m;
        b[m]++;
    }
    for (int i = 0; i < 51; i++)
    {
        if (b[i])
            cout << i << ":" << b[i] << endl;
    }

    return 0;
}
